IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM14_CONTROLSS_G2_EPWM14.xml
	<register id="CONTROLSS_G2_EPWM14_AQCSFRC" acronym="CONTROLSS_G2_EPWM14_AQCSFRC" offset="0x92" width="16" description="Action Qualifier Continuous S/W Force Register ">
		<bitfield id="CSFB" width="2" begin="3" end="2" resetval="0x0" description="Continuous Software Force on Output B  In immediate mode, a continuous force takes effect on the next TBCLK edge. In shadow mode, a continuous force takes effect on the next TBCLK edge after a shadow load into the active register. To configure shadow mode, use AQSFRC[RLDCSF].   00: Software forcing is disabled and has no effect  01: Forces a continuous low on output B  10: Forces a continuous high on output B  11: Software forcing is disabled and has no effect" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="CSFA" width="2" begin="1" end="0" resetval="0x0" description="Continuous Software Force on Output A  In immediate mode, a continuous force takes effect on the next TBCLK edge. In shadow mode, a continuous force takes effect on the next TBCLK edge after a shadow load into the active register.   00: Software forcing is disabled and has no effect  01: Forces a continuous low on output A  10: Forces a continuous high on output A  11: Software forcing is disabled and has no effect" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM14_DBREDHR" acronym="CONTROLSS_G2_EPWM14_DBREDHR" offset="0xA0" width="16" description="Dead-Band Generator Rising Edge Delay High Resolution Mirror Register ">
		<bitfield id="DBREDHR" width="7" begin="15" end="9" resetval="0x0" description="Dead Band Rising Edge Delay High Resolution Bits" range="15 - 9" rwaccess="R/W"/> 
		<bitfield id="DBREDHR_DELAY" width="7" begin="7" end="1" resetval="0x0" description="These 7-bits contain the results of OTTO calculation [if auto-conversion is enabled]" range="7 - 1" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G2_EPWM14_DBRED" acronym="CONTROLSS_G2_EPWM14_DBRED" offset="0xA2" width="16" description="Dead-Band Generator Rising Edge Delay High Resolution Mirror Register ">
		<bitfield id="DBRED" width="14" begin="13" end="0" resetval="0x0" description="Rising edge delay value" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM14_DBFEDHR" acronym="CONTROLSS_G2_EPWM14_DBFEDHR" offset="0xA4" width="16" description="Dead-Band Generator Falling Edge Delay High Resolution Register ">
		<bitfield id="DBFEDHR" width="7" begin="15" end="9" resetval="0x0" description="Dead Band Falling Edge Delay High Resolution Bits" range="15 - 9" rwaccess="R/W"/> 
		<bitfield id="DBFEDHR_DELAY" width="7" begin="7" end="1" resetval="0x0" description="These 7-bits contain the results of OTTO calculation [if auto-conversion is enabled]" range="7 - 1" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G2_EPWM14_DBFED" acronym="CONTROLSS_G2_EPWM14_DBFED" offset="0xA6" width="16" description="Dead-Band Generator Falling Edge Delay Count Register">
		<bitfield id="DBFED" width="14" begin="13" end="0" resetval="0x0" description="Falling Edge Delay Count   14-bit counter" range="13 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM14_TBPHS" acronym="CONTROLSS_G2_EPWM14_TBPHS" offset="0xC0" width="32" description="Time Base Phase High">
		<bitfield id="TBPHS" width="16" begin="31" end="16" resetval="0x0" description="Phase Offset Register  These bits set time-base counter phase of the selected ePWM relative to the time-base that is supplying the synchronization input signal.  - If TBCTL[PHSEN] = 0, then the synchronization event is ignored and the time-base counter is not loaded with the phase. - If TBCTL[PHSEN] = 1, then the time-base counter [TBCTR] will be loaded with the phase [TBPHS] when a synchronization event occurs. The synchronization event can be initiated by the input synchronization signal [EPWMxSYNCI] or by a software forced synchronization." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="TBPHSHR" width="16" begin="15" end="0" resetval="0x0" description="Phase Offset [High Resolution] Register. TBPHSHR must not be used. Instead TRREM [HRPWM remainder register] must be used to mimic the functionality of TBPHSHR.   The lower 8 bits in this register are ignored - writes are ignored and reads return zero" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM14_TBPRDHR" acronym="CONTROLSS_G2_EPWM14_TBPRDHR" offset="0xC4" width="16" description="Time Base Period High Resolution Register ">
		<bitfield id="TBPRDHR" width="16" begin="15" end="0" resetval="0x0" description="Period High Resolution Bits  The upper 8-bits contain the high-resolution portion of the period value. The TBPRDHR register is not affected by the TBCTL[PRDLD] bit. Reads from this register always reflect the shadow register. Likewise writes are also to the shadow register. The TBPRDHR register is only used when the high resolution period feature is enabled. This register is only available with ePWM modules which support high-resolution period control.  The lower 8 bits in this register are ignored - writes are ignored and reads return zero" range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM14_TBPRD" acronym="CONTROLSS_G2_EPWM14_TBPRD" offset="0xC6" width="16" description="Time Base Period Register ">
		<bitfield id="TBPRD" width="16" begin="15" end="0" resetval="0x0" description="Time Base Period Register  These bits determine the period of the time-base counter. This sets the PWM frequency. Shadowing of this register is enabled and disabled by the TBCTL[PRDLD] bit. By default this register is shadowed. - If TBCTL[PRDLD] = 0, then the shadow is enabled and any write or read will automatically go to the shadow register. In this case, the active register will be loaded from the shadow register when the time-base counter equals zero. - If TBCTL[PRDLD] = 1, then the shadow is disabled and any write or read will go directly to the active register, that is the register actively controlling the hardware. - The active and shadow registers share the same memory map address." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM14_TBPRDHRB" acronym="CONTROLSS_G2_EPWM14_TBPRDHRB" offset="0xC8" width="16" description="Calculation Result for EPWMxB">
		<bitfield id="TBPRDHRB" width="8" begin="15" end="8" resetval="0x0" description="TBPRD High Resolution Calculation [2] Results for EPWMxB HRPWM Equations" range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TBPRDHRB_DELAY" width="8" begin="7" end="0" resetval="0x0" description="TBPRDHRB Delay" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G2_EPWM14_CMPA" acronym="CONTROLSS_G2_EPWM14_CMPA" offset="0xD4" width="32" description="Counter Compare A Register ">
		<bitfield id="CMPA" width="16" begin="31" end="16" resetval="0x0" description="Compare A Register  The value in the active CMPA register is continuously compared to the time-base counter [TBCTR]. When the values are equal, the counter-compare module generates a time-base counter equal to counter compare A event. This event is sent to the action-qualifier where it is qualified and converted it into one or more actions. These actions can be applied to either the EPWMxA or the EPWMxB output depending on the configuration of the AQCTLA and AQCTLB registers. The actions that can be defined in the AQCTLA and AQCTLB registers include:  - Do nothing  the event is ignored. - Clear: Pull the EPWMxA and/or EPWMxB signal low - Set: Pull the EPWMxA and/or EPWMxB signal high - Toggle the EPWMxA and/or EPWMxB signal  Shadowing of this register is enabled and disabled by the CMPCTL[SHDWAMODE] bit. By default this register is shadowed. - If CMPCTL[SHDWAMODE] = 0, then the shadow is enabled and any write or read will automatically go to the shadow register. In this case, the CMPCTL[LOADAMODE] bit field determines which event will load the active register from the shadow register. - Before a write, the CMPCTL[SHDWAFULL] bit can be read to determine if the shadow register is currently full. - If CMPCTL[SHDWAMODE] = 1, then the shadow register is disabled and any write or read will go directly to the active register, that is the register actively controlling the hardware. - In either mode, the active and shadow registers share the same memory map address." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="CMPAHR" width="16" begin="15" end="0" resetval="0x0" description="Compare A HRPWM Extension Register  The UPPER 8-bits contain the high-resolution portion [most significant 8-bits] of the counter-compare A value. CMPA:CMPAHR can be accessed in a single 32-bit read/write. Shadowing is enabled and disabled by the CMPCTL[SHDWAMODE] bit as described for the CMPA register.  The lower 8 bits in this register are ignored" range="15 - 0" rwaccess="R/W"/>
	</register>
